---
kind: method
id: M:Autodesk.Revit.DB.Structure.Hub.HasOrigin
source: html/db55d7cc-9abd-34dd-9939-4c10420ae2c2.htm
---
# Autodesk.Revit.DB.Structure.Hub.HasOrigin Method

Provides information if Hub has a specific location at point in 3D space.

## Syntax (C#)
```csharp
public bool HasOrigin()
```

## Returns
True if the Hub has a specific location at point in 3D space.